Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: (Irreflexivity)
ja: （非反射）

source: (Reflexivity)
ja: （反射性）

source: (Symmetry)
ja: （対称性）

source: (Transitive comparability)
ja: （推移的比較性）

source: (Transitive incomparability)
ja: （推移的比較不能性）

source: (Transitivity)
ja: （推移性）

source: / ...unless you explicitly convert it to a localized string key.
ja: / ...あなたがそれをあるローカライズされた文字列キーへと明示的に変換しない限りは。

source: / A for-in loop over 'ranges' accesses each range:
ja: / 「ranges」に対するfor-inループは、各範囲にアクセスします：

source: / A list of items, where the last row, when triggered,
ja: / 項目いくつかからなるあるリスト、そこにおいて最後の行は、作動させられる時に、

source: / A set is never a strict subset of itself:
ja: / A集合は決してそれ自身の狭義の下位集合ではありません。

source: / A set is never a strict superset of itself:
ja: / A集合は決してそれ自身の狭義の上位集合ではありません：

source: / All successes are equivalent, so none is before any other
ja: / すべての成功は等しい、なので何か他の前に来るものはありません

source: / Apply the border first this time.
ja: / 境界線を最初にこの時に適用します。

source: / Can only ship standard or priority to PO Boxes
ja: / 標準または優先のみが私書箱に出荷できるなら

source: / Displays the contents of `someString` without localization.
ja: / `someString` の内容を現地語化なしで表示します。

source: / Don't localize a string variable...
ja: / 文字列変数をローカライズしません...

source: / Example of binding to an immutable value.
ja: / 不変の値へのバインディングの例。

source: / Localizes the key if possible, or displays "pencil" if not.
ja: / 可能ならばキーをローカライズします、またはそうでないならば "pencil" を表示します。

source: / Order errors before successes
ja: / 成功の前にエラーを並べる

source: / Order errors by code
ja: / エラーをコードによって並べる

source: / Same as above
ja: / 上と同じ

source: / Searches the default table in the main bundle.
ja: / メインバンドルの中の省略時のテーブルを検索する。

source: / Set a default for text in the stack.
ja: / スタックの中のテキストに対する初期状態を設定する。

source: / Text to use as a caption.
ja: / キャプションとして使うテキスト。

source: / Use 'joined()' to access each element of each range:
ja: / 「joined()」を使うことで、各範囲の各要素にアクセスしてください：

source: / opens a UI for adding a new item.
ja: / 新しい項目を加えるためのある UI を開きます。

source: (true, newMember) if newMember was not contained in self.
ja: (true, newMember)、もしnewMemberがselfに含まれなかったならば。

source: (true, newMember) if newMember was not contained in the set.
ja: (true, newMember)、もしnewMemberがこの集合の中に含まれなかったならば。

source: .default: shown by default prior to user customization, but removable.
ja: .default: 初期状態ではユーザのカスタマイズの前に示される、しかし取り除くことができる。

source: .optional: not visible by default, but can be added through the customization palette.
ja: .optional: 初期状態では可視ではない、しかしカスタマイゼーションパレットを通して追加できる。

source: .required: not allowed to be removed by the user.
ja: .required: ユーザによって取り除かれることを許可しない。

source: Coordinator can be accessed via Context.
ja: Coordinatorは、Context経由でアクセスされることができます。

source: NSObject implements this by calling lhs.isEqual(rhs).
ja: NSObjectは、これをlhs.isEqual(rhs)を呼び出すことによって実装します。

source: NSObject implements this by feeding self.hash to the hasher.
ja: NSObjectは、これをself.hashをハーシャーに供給することによって実装します。

source: NSObject implements this by returning self.hash.
ja: NSObjectは、これをself.hashを返すことによって実装します。

source: NSObject.hash(into:) is not overridable; subclasses can customize hashing by overriding the hash property.
ja: NSObject.hash(into:)は、オーバーライド可能ではありません；サブクラスはハッシュ化をカスタマイズすることがhashプロパティをオーバーライドすることによって可能です。

source: NSObject.hashValue is not overridable; subclasses can customize hashing by overriding the hash property.
ja: NSObject.hashValueは、オーバーライド可能ではありません；サブクラスはハッシュ化をカスタマイズすることがhashプロパティをオーバーライドすることによって可能です。

source: VectorArithmetic extends the AdditiveArithmetic protocol with scalar multiplication and a way to query the vector magnitude of the value.
ja: VectorArithmeticは、AdditiveArithmeticプロトコルを、スカラー乗法そして値のベクトル振幅を問いただす方法で拡張します。

source: alignment applies if this view is smaller than the size given by the resulting frame.
ja: alignmentは、結果フレームによって与えられる大きさよりこのビューが小さいならば適用されます。

source: areEquivalent(a, a) is always true.
ja: areEquivalent(a, a)は常にtrueである。

source: areEquivalent(a, b) implies areEquivalent(b, a).
ja: areEquivalent(a, b)はareEquivalent(b, a)を意味する。

source: areInIncreasingOrder(a, a) is always false.
ja: areInIncreasingOrder(a, a)は常にfalseである。

source: content is a proxy for the view that will have the modifier represented by Self applied to it.
ja: contentは、ビューに対するプロキシです、それはそれに適用されるSelfによって表わされる修飾子を持つでしょう。

source: end must be a valid index of the collection that is not equal to the endIndex property.
ja: endはコレクションの有効なインデックスで、endIndexプロパティと等しくないものでなければなりません。

source: end must be a valid index of the collection.
ja: endはコレクションのひとつの有効なインデックスでなければなりません。

source: eoFill defines whether the shape is interpreted with the even-odd winding number rule.
ja: eoFillは、形状が偶奇曲折数規則で解釈されるかどうかを定義します。

source: i must be greater than startIndex.
ja: iはstartIndexより大きくなければなりません。

source: i must be less than endIndex.
ja: iはendIndexより少なくなければなりません。

source: initialResult is passed to nextPartialResult the first time the closure is executed.
ja: initialResultはnextPartialResultに、クロージャが実行される最初の時に渡されます。

source: k must be greater than or equal to zero.
ja: kは、ゼロより大きいまたは等しくなければなりません。

source: maxLength must be greater than or equal to zero.
ja: maxLengthは、ゼロより大きいか等しくなければなりません。

source: onIncrement will be initialized to nil if attempting to increment value will have no effect.
ja: onIncrementはnilに初期化されるでしょう、もしvalueを漸増する試みが効果を持たないならば。

source: resetTransaction resets the state back to the initial value when the associated gesture becomes inactive.
ja: resetTransactionは、結びつけられたジェスチャが不活発になる時は、状態を初期値へとリセットします。

source: start must be a valid index of the collection.
ja: startはコレクションのひとつの有効なインデックスでなければなりません。

source: transform accepts an element of this sequence as its parameter and returns a transformed value of the same or of a different type.
ja: transformはこのシーケンスのひとつの要素をそれのパラメータとして受け取り、同じもしくは異なる型の変換された値を返します。

source: true if i has been offset by exactly distance steps without going beyond limit; otherwise, false.
ja: true、もしiがぴったりdistance幅だけlimitを越えることなく補われたならば；そうでなければ、false。

source: true if lhs is greater than or equal to rhs; otherwise, false.
ja: trueを、lhsがrhsより大きいか等しいならば返します；そうでなければ、false。

source: true if the element was found in the sequence; otherwise, false.
ja: 要素がシーケンスにおいて見つけられなかったならば、true；そうでなければ、false。

source: true if the initial elements of the sequence are equivalent to the elements of possiblePrefix; otherwise, false.
ja: シーケンスの冒頭の要素がpossiblePrefixの要素と等しいならばtrue；そうでなければfalse。

source: true if the initial elements of the sequence are the same as the elements of possiblePrefix; otherwise, false.
ja: シーケンスの冒頭の要素がpossiblePrefixの要素と同じならばtrue；そうでなければfalse。

source: true if the option set contains member; otherwise, false.
ja: true、もしオプションセットがmemberを含むならば；そうでなければfalse。

source: true if the sequence contains an element that satisfies predicate; otherwise, false.
ja: このシーケンスがpredicate;を満たす要素を含むならばtrue；そうでなければ、false。

source: true if the sequence contains only elements that satisfy predicate; otherwise, false.
ja: true、もしシーケンスがpredicateを満たす要素だけを含むならば；そうでなければ、false。

source: true if the set has no elements in common with other; otherwise, false.
ja: この集合がotherと共通の要素を持たないならばtrue；そうでなければ、false。

source: true if the set is a strict subset of other; otherwise, false.
ja: この集合がotherの狭義の部分集合ならばtrue；そうでなければ、false。

source: true if the set is a strict superset of other; otherwise, false.
ja: この集合がotherの狭義の上位集合であるならばtrue；そうでなければ、false。

source: true if the set is a subset of other; otherwise, false.
ja: この集合がotherの部分集合ならばtrue；そうでなければ、false。

source: true if the set is a superset of other; otherwise, false.
ja: この集合がotherの上位集合であるならばtrue；そうでなければ、false。

source: true if the two items are equal, or false if they are not equal.
ja: true、もし２つの項目が等しいならば、またはfalse、もしそれらが等しくないならば。

source: true if the two items are not equal, or false if they are equal.
ja: true、もし２つの項目が等しくないならば、またはfalse、もしそれらが等しいならば。

source: true if the view controller contains the focus environment, or false if it doesn't.
ja: true、ビューコントローラがフォーカス環境を持つならば、false、それがそうでないならば。

source: true if this sequence and other contain equivalent items, using areEquivalent as the equivalence test; otherwise, false.
ja: true、このシーケンスとotherがareEquivalentを同等性テストとして使って同じ要素らを含むならば；そうでなければ、false。

source: true if this sequence and other contain the same elements in the same order.
ja: このシーケンスとotherが同じ要素を同じ順序で含んでいるならば、true。

source: true if this sequence precedes other in a dictionary ordering as ordered by areInIncreasingOrder; otherwise, false.
ja: このシーケンスがotherに、areInIncreasingOrderによって並べられる通りのある字典順序において先行するならば、true；そうでなければ、false。

source: true if this sequence precedes other in a dictionary ordering; otherwise, false.
ja: このシーケンスがotherに、ある字典順序において先行するならば、true；そうでなければ、false。

source: NSXMLElement implements isEqual(_:) to perform a deep comparison: two XMLDocument objects are not considered equal unless they have the same name, same child nodes, same attributes, and so on.
ja: NSXMLElementはisEqual(_:)を実装して、ある深い比較を実行します：２つのXMLDocumentオブジェクトは、それらが同じ名前、同じ子ノード、同じ属性、などを持たない限り、等しいと見なされません。

source: NSXMLNode declares the following constants of type NSXMLNodeKind for specifying a node’s kind in the initializer methods init(kind:) and init(kind:options:):
ja: NSXMLNodeは、型NSXMLNodeKindの以下の定数を、イニシャライザメソッドinit(kind:)とinit(kind:options:): においてあるノードのもつ種類を指定するために宣言します。

source: onChange is called on the main thread.
ja: onChangeは、メインスレッド上で呼び出されます。

source: distance must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: distanceは負であってはいけません、そのコレクションがBidirectionalCollectionプロトコルに準拠する場合を除いては。

source: Slider uses the SliderStyle provided by its environment to define its appearance and interaction.
ja: Sliderは、それの環境によって提供されるSliderStyleを使って、それの外観と相互作用を定義します。

source: Stepper uses the StepperStyle provided by its environment to define its appearance and interaction.
ja: Stepperは、それの環境によって提供されるStepperStyleを使って、それの外観と相互作用を定義します。

source: Toggle uses the ToggleStyle provided by its environment to define its appearance and interaction.
ja: Toggleは、それの環境によって提供されるToggleStyleを使って、それの外観と相互作用を定義します。

source: maxSplits must be greater than or equal to zero.
ja: maxSplitsは、ゼロより大きいか等しくなければなりません。

source: States and bindings connect views to your app’s underlying data model.
ja: 状態とバインディングは、ビューをあなたのアプリのもつ基礎をなすデータモデルと接続します。

source: Pipe objects provide an object-oriented interface for accessing pipes.
ja: Pipeオブジェクトは、オブジェクト指向インターフェイスをパイプにアクセスするために提供します。

source: XMLDTDNode objects are the sole children of a XMLDTD object (possibly along with comment nodes and processing-instruction nodes).
ja: XMLDTDNodeオブジェクトそれらは、XMLDTDオブジェクトの単独の子孫です（おそらくコメントノードと処理命令ノードに加えて）。

source: XMLDTDNode objects can be of four kinds—element, attribute-list, entity, or notation declaration—and can also be of a subkind, as specified by a XMLDTDNode.DTDKind constant.
ja: XMLDTDNodeオブジェクトは４つの種類 — 要素、属性リスト、エンティティ、または表記法宣言 — が可能です、そしてまた下位種類も可能です、XMLDTDNode.DTDKind定数で指定されるように。

source: Axiom: x == y implies x.hashValue == y.hashValue
ja: 公理： x == y は暗黙的に x.hashValue == y.hashValue

source: Required.
ja: 必須。

source: Required. Default implementation provided.
ja: 必須。 提供される省略時の実装。

source: Required. Default implementations provided.
ja: 必須。 提供される省略時の実装いくつか。

source: XMLNode specifies the interface common to all XML node objects and defines common node behavior and attributes, for example hierarchy level, node name and value, tree traversal, and the ability to emit representative XML markup text.
ja: XMLNodeは、XMLノードオブジェクトに一般的なインターフェイスを指定します、そして一般的ノード挙動と属性を定義します、例えば改装水準、ノード名と値、ツリー探索、そして代表的XMLマークアップテキストを発行するなど。

source: XMLNode objects can also represent document type declarations as well as declarations in Document Type Definitions (DTDs).
ja: XMLNodeオブジェクトはまた、書類型宣言を表します、それだけでなくDocument Type Definition（DTD）それらにおける宣言も。

source: Pipe is an abstract class, the public interface of a class cluster.
ja: Pipeは、ある抽象クラス、あるクラスクラスタのパブリックインターフェイスです。

source: A 2D shape that you can use when drawing a view.
ja: ある2D形状、それはあなたがビューを描画する時に使用できるものです。

source: A Binding to the variable containing a Color.
ja: Colorを含んでいる変数へのBinding。

source: A Binding to the variable that displays the selected Color.
ja: 選択されたColorを表示する変数へのBinding。

source: A CGAffineTransform to apply to the view.
ja: CGAffineTransformをこのビューに適用します。

source: A CGSize that represents the horizontal and vertical amount to scale the view.
ja: あるCGSize、それはこのビューを拡大縮小するための水平および垂直の量を表します。

source: A HorizontalAlignment value at which to a base the offset.
ja: あるHorizontalAlignment値、それでオフセットの基準とします。

source: A ProjectionTransform to apply to the view.
ja: ProjectionTransformをこのビューに適用します。

source: A Scanner object interprets and converts the characters of a String into number and string values.
ja: あるScannerオブジェクトは、あるStringの文字を数および文字列値へと解釈および変換します。

source: A Process object creates a separate executable entity; it differs from Thread in that it does not share memory space with the process that creates it.
ja: Processオブジェクトはある独立した実行可能形式存在を作成します；それはThreadとは違います、それにおいてそれはメモリ空間をそれを作成するプロセスと共有しません。

source: A Boolean value indicating whether two values are equal.
ja: ２つの値が等しいかどうかを指し示しているBoolean値。

source: A Collection that provides its own implementation of this method must also guarantee that an equivalent buffer of its SubSequence can be generated by advancing the pointer by the distance to the slice’s startIndex.
ja: このメソッドの独自の実装を提供するCollectionはまた、それのSubSequenceの等価バッファが、そのスライスのもつstartIndexまでの間隔だけポインタを前進することによって生成できることを保証しなければなりません。

source: A Color is a late-binding token: SwiftUI only resolves it to a concrete value just before using it in a given environment.
ja: Colorは遅延バインディングのトークンです：SwiftUIはそれを具象値へと解決するだけです、それをある与えられた環境で使う直前に。

source: A GestureState updates its data as the gesture changes, and implicitly resets when the gesture becomes inactive.
ja: GestureStateは、それのデータをジェスチャが変化するにつれて更新します、そしてジェスチャが不活発になる時に暗黙的にリセットします。

source: A ListStyle that implements the carousel List interaction and appearance.
ja: あるListStyle、それは回転式List相互作用および外観を実装します。

source: A ListStyle that implements the system default List interaction and appearance.
ja: あるListStyle、それはシステム初期状態List相互作用および外観を実装します。

source: A ListStyle that implements the system default grouped List interaction and appearance.
ja: あるListStyle、それはシステム初期状態グループList相互作用および外観を実装します。

source: A ListStyle that implements the system default sidebar list (or source list) interaction and appearance.
ja: あるListStyle、それはシステム初期状態サイドバーリスト（またはソースリスト）相互作用および外観を実装します。

source: A State instance isn’t the value itself; it’s a means of reading and writing the value.
ja: Stateインスタンスはそれ自身は値ではありません；それは値の読み書きのひとつの手段です。

source: A UIViewController object that you can present from your interface.
ja: あるUIViewControllerオブジェクト、それはあなたがあなたのインターフェイスから提示できるものです。

source: A UIViewControllerRepresentableContext structure contains details about the current state of the system.
ja: UIViewControllerRepresentableContext構造体は、システムの現在の状態についての詳細を含みます。

source: A UIViewRepresentableContext structure contains details about the current state of the system.
ja: UIViewRepresentableContext構造体は、システムの現在の状態についての詳細を含みます。

source: A WKHostingController presents and manages your app's main interface using SwiftUI views.
ja: WKHostingControllerは、あなたのアプリのもつメインインターフェイスをSwiftUIビューを使って提示および管理します。

source: A WKInterfaceObjectRepresentableContext structure contains details about the current state of the system.
ja: WKInterfaceObjectRepresentableContext構造体は、システムの現在の状態についての詳細を含みます。

source: A WKUserNotificationHostingController presents and manages your app's notification interface using SwiftUI views.
ja: WKUserNotificationHostingControllerは、あなたのアプリのもつ通知インターフェイスをSwiftUIビューを使って提示および管理します。

source: A Bool value indicating whether the content size category is one that is associated with accessibility.
ja: あるBool値、コンテンツサイズカテゴリがアクセシビリティと結び付けられるものであるかどうかを指し示しています。

source: A contextMenu that contains one or more menu items.
ja: あるcontextMenu、それは１つ以上のメニュー項目を含みます。

source: A ReversedCollection instance wraps an underlying collection and provides access to its elements in reverse order.
ja: ReversedCollectionインスタンスは、基礎をなすコレクションをラップして、それの要素へのアクセスを逆順で提供します。

source: A constant range of data to populate the list.
ja: リストを満たすことになるデータの定数範囲。

source: A constant range.
ja: ある定数範囲。

source: A Binding to a boolean value indicating whether the overlay should be presented.
ja: オーバーレイが提示されるべきかどうかを指し示すブール値へのあるバインディング。

source: A Boolean that indicates whether the button should include a visual indicator that it represents a menu, such as an arrow.
ja: あるブール値、それは、そのボタンがメニューを表す視覚的指示子、たとえば矢印を含むべきかどうかを指し示します。

source: A Boolean that indicates whether the shape is interpreted with the even-odd winding number rule.
ja: あるブール値、それは形状が偶奇曲折数規則で解釈されるかどうかを指し示しxdd/dます。

source: A Boolean that indicates whether the user is currently pressing the button.
ja: あるブール値、それはユーザが現在ボタンを押しているかどうかを指し示します。

source: A Boolean that is true if the drop was successful, false otherwise.
ja: あるブール値、それはドロップがうまくいったならばtrueです、そうでなければfalse。

source: A Boolean value indicating whether the collection is empty.
ja: コレクションが空かどうかを指し示すブール値。

source: A Boolean value indicating whether the path contains zero elements.
ja: パスがゼロ個の要素を含むかどうかを指し示しているブール値。

source: A Boolean value indicating whether to fix the height of the view.
ja: ビューの高さを治すべきかどうかを指し示しているブール値。

source: A Boolean value indicating whether to fix the width of the view.
ja: ビューの幅を治すべきかどうかを指し示しているブール値。

source: A Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示しているブール値。

source: A Boolean value set to true if the two truncation modes are equal.
ja: あるブール値、trueに設定されます、もし２つの切り詰めモードが等しいならば。

source: A Boolean value set to true if the two truncation modes are not equal.
ja: あるブール値、trueに設定されます、もし２つの切り詰めモードが等しくないならば。

source: A Boolean value that determines whether the parser reports declarations of external entities.
ja: あるブール値、それはパーサーが外部エンティティの宣言を報告するかどうかを決定します。

source: A Boolean value that determines whether the parser reports the namespaces and qualified names of elements.
ja: あるブール値、それはパーサーが要素の名前空間と修飾名を報告するかどうかを決定します。

source: A Boolean value that determines whether the parser reports the prefixes indicating the scope of namespace declarations.
ja: あるブール値、それはパーサーが名前空間宣言のスコープを指し示す接頭辞を報告するかどうかを決定します。

source: A Boolean value that determines whether the view hierarchy has auto-correction enabled.
ja: あるブール値、それはビュー階層が自動補正を可能にされるかどうかを決定します。

source: A Boolean value that determines whether users can interact with this view.
ja: あるブール値、それはユーザがこのビューと相互作用できるかどうかを決定します。

source: A Boolean value that indicates whether autocorrection is disabled for this view.
ja: あるブール値、それは自動修正がこのビューに対して無効にされるかどうかを指し示します。

source: A Boolean value that indicates whether inter-character spacing should tighten to fit the text into the available space.
ja: あるブール値、それは文字間の空きが引き締められてテキストを利用可能な空間へとぴったり合わせるべきかどうかを指し示します。

source: A Boolean value that indicates whether smoothing is applied to the edges of the clipping rectangle.
ja: あるブール値、それは滑らかさが切り抜き矩形の縁に適用されるかどうかを指し示します。

source: A Boolean value that indicates whether the blur renderer permits transparency in the blur output.
ja: あるブール値、それはぼかし描画子が透明度をぼかし出力において許可するかどうかを指し示します。

source: A Boolean value that indicates whether the color picker allows adjusting the selected color’s opacity; the default is true.
ja: あるブール値、それはカラーピッカーがその選択された色のもつ不透明度を調節することを可能にするかどうかを指し示します；省略時はtrueです。

source: A Boolean value that indicates whether the color picker allows adjustments to the selected color’s opacity; the default is true.
ja: あるブール値、それはカラーピッカーがその選択された色のもつ不透明度への調節を可能にするかどうかを指し示します；省略時はtrueです。

source: A Boolean value that indicates whether the image is opaque.
ja: あるブール値、それは画像が不透明であるかどうかを指し示します。

source: A Boolean value that indicates whether the rendering system applies smoothing to the edges of the clipping rectangle.
ja: あるブール値、それは滑らかさが切り抜き矩形の縁に適用されるかどうかを指し示します。

source: A Boolean value that indicates whether the scroll view displays the scrollable component of the content offset, in a way suitable for the platform.
ja: あるブール値、それは、スクロールビューが、プラットホームに適している方法で、そのコンテンツオフセットのスクロール可能構成要素を表示するかどうかを指し示します。

source: A Boolean value that indicates whether the set has no elements.
ja: 集合が要素をひとつも持たないかどうかを指し示すブール値。

source: A Boolean value that indicates whether the space between characters compresses when necessary.
ja: あるブール値、それは必要な場合は文字間の空間が縮むかどうかを指し示します。

source: A Boolean value that indicates whether the text has a strikethrough applied.
ja: あるブール値、それはテキストが取り消し線を適用されているかどうかを指し示します。

source: A Boolean value that indicates whether the text has an underline.
ja: あるブール値、それはテキストが下線を持つかどうかを指し示します。

source: A Boolean value that indicates whether the transaction originated from an action that produces a sequence of values.
ja: あるブール値、それはそのトランザクションがいくつかの値からなるあるシーケンスを生み出すあるアクションから生じるかどうかを指し示します。

source: A Boolean value that indicates whether the user has enabled an assistive technology.
ja: あるブール値、それはユーザが補助技術を可能にしているかどうかを指し示します。

source: A Boolean value that indicates whether the view associated with this environment allows user interaction.
ja: あるブール値、それはこの環境と結びつけられたビューがユーザ相互作用を可能にするかどうかを指し示します。

source: A Boolean value that indicates whether the view controller prefers the status bar to be hidden or shown.
ja: あるブール値、それはビューコントローラがステータスバーに隠されるまたは表示されることを望むかどうかを指し示します。

source: A Boolean value that indicates whether this view flips its content horizontally when the layout direction is right-to-left.
ja: あるブール値、それはこのビューがそれの内容を水平にフリップするかどうかを指し示します、レイアウト方向が右から左である場合に。

source: A Boolean value that indicates whether this view is focusable.
ja: あるブール値、それはこのビューがフォーカス可能かどうかを指し示します。

source: A Boolean value that indicates whether to apply antialiasing the edges of a shape.
ja: あるブール値、それは形状の縁をアンチエイリアシングすることを適用するべきかどうかを指し示します。

source: A Boolean value that indicates whether to display this view prominently in the Touch Bar compared to other views.
ja: あるブール値、それはこのビューをTouch Barにおいて他のビューと比較して目立つように表示するかどうかを指し示します。

source: A Boolean value that indicates whether to fix the height of the view.
ja: あるブール値、それはビューの高さを治すべきかどうかを指し示します。

source: A Boolean value that indicates whether to fix the width of the view.
ja: あるブール値、それはビューの幅を治すべきかどうかを指し示します。

source: A Boolean value that indicates whether to hide the back button.
ja: あるブール値、それは戻るボタンを隠すべきかどうかを指し示します。

source: A Boolean value that indicates whether to hide the navigation bar.
ja: あるブール値、それはナビゲーションバーを隠すべきかどうかを指し示します。

source: A Boolean value that indicates whether to hide the status bar.
ja: あるブール値、それはステータスバーを隠すべきかどうかを指し示します。

source: A Boolean value that indicates whether to use antialiasing when rendering the edges of a shape.
ja: あるブール値、それはアンチエイリアシングを形状の縁を描出するときに使うかどうかを指し示します。

source: A Boolean value that indicates whether to use the even-od rule for rendering a shape.
ja: あるブール値、それは偶奇規則を形状の描出に使うかどうかを指し示します。

source: A Boolean value that indicates whether to use the even-odd rule when rendering a shape.
ja: あるブール値、それはある形状を描出する場合に偶奇規則を使用すべきかどうかを指し示します。

source: A Boolean value that indicates whether views should disable animations.
ja: あるブール値、それはビューがアニメーションを作動しなくするべきかどうかを指し示します。

source: A Boolean value that’s true when two text views are equal.
ja: あるブール値、それは２つのテキストビューが等しい場合はtrueです。

source: A Boolean value that’s true when two text views are not equal.
ja: あるブール値、それは２つのテキストビューが等しくない場合はtrueです。

source: A Touch Bar view with one element centered in the Touch Bar row.
ja: Touch Bar横列において中心にくるある要素をもつTouch Barビュー。

source: A UIKit view controller that manages a SwiftUI view hierarchy.
ja: あるUIKitビューコントローラ、それはあるSwiftUIビュー階層を管理します。

source: A View created from a swift tuple of View values.
ja: View値それらからなるあるswiftタプルから作成されるあるView。

source: A WatchKit interface controller that hosts a SwiftUI view hierarchy.
ja: あるWatchKitインターフェイスコントローラ、それはSwiftUIビュー階層をホストします。

source: A WatchKit interface controller which hosts a SwiftUI view hierarchy.
ja: WatchKitインターフェイスコントローラ、それはSwiftUIビュー階層をホストします。
